package com.legenda.lee.studytest.aboutString;

/**
 * @author: Legenda-Lee(lee.legenda@gmail.com)
 * @date: 2021-08-05 10:53 上午
 * @description:
 */
public class TestAdd {

    public static void main(String[] args) {
        String a ="止嗽咳喘宁糖浆\n" +
                "复方氨酚那敏颗粒\n" +
                "苯酰甲硝唑干混悬剂\n" +
                "乙酰半胱氨酸泡腾片\n" +
                "盐酸左氧氟沙星胶囊\n" +
                "盐酸左氧氟沙星片\n" +
                "诺氟沙星胶囊\n" +
                "左氧氟沙星片\n" +
                "加替沙星胶囊\n" +
                "盐酸环丙沙星胶囊\n" +
                "加替沙星片\n" +
                "诺氟沙星片\n" +
                "盐酸环丙沙星片\n" +
                "盐酸莫西沙星片\n" +
                "乳酸左氧氟沙星分散片\n" +
                "乳酸左氧氟沙星片\n" +
                "甲磺酸左氧氟沙星片\n" +
                "氧氟沙星片\n" +
                "乳酸左氧氟沙星胶囊\n" +
                "欧意诺氟沙星胶囊\n" +
                "盐酸左氧氟沙星分散片\n" +
                "盐酸洛美沙星胶囊\n" +
                "氧氟沙星胶囊\n" +
                "甲磺酸左氧氟沙星胶囊\n" +
                "乳酸左氧氟沙星氯化钠注射液\n" +
                "甲苯磺酸妥舒沙星片\n" +
                "盐酸加替沙星胶囊\n" +
                "苹果酸奈诺沙星胶囊\n" +
                "甲苯磺酸妥舒沙星分散片\n" +
                "盐酸加替沙星片\n" +
                "盐酸左氧氟沙星氯化钠注射液\n" +
                "盐酸左氧氟沙星注射液\n" +
                "甲磺酸培氟沙星片\n" +
                "司帕沙星片\n" +
                "乳酸氟罗沙星片\n" +
                "乳酸左氧氟沙星注射液\n" +
                "氧氟沙星栓\n" +
                "巴洛沙星片\n" +
                "巴洛沙星胶囊\n" +
                "甲磺酸吉米沙星片\n" +
                "氟罗沙星胶囊\n" +
                "盐酸安妥沙星片\n" +
                "甲磺酸培氟沙星胶囊\n" +
                "甲磺酸帕珠沙星氯化钠注射液\n" +
                "环丙沙星片";

        String b = a.replaceAll("\\n", "');\n");
        System.out.println(b);
    }
}
