package com.legenda.lee.studytest.aboutString;

/**
 * @author: Legenda-Lee(lee.legenda@gmail.com)
 * @date: 2021-08-05 10:53 上午
 * @description:
 */
public class TestAdd {

    public static void main(String[] args) {
        String a =
                ",'阿普唑仑片\n" +
                ",'阿司匹林可待因片\n" +
                ",'阿托品异丙嗪注射液\n" +
                ",'艾司唑仑片\n" +
                ",'艾司唑仑注射液\n" +
                ",'安钠咖片\n" +
                ",'安钠咖注射液\n" +
                ",'安乃近氯丙嗪注射液\n" +
                ",'氨酚羟考酮片\n" +
                ",'氨酚氢可酮片\n" +
                ",'奥沙西泮片\n" +
                ",'苯巴比妥东莨菪碱片\n" +
                ",'苯巴比妥钠注射液\n" +
                ",'苯巴比妥片\n" +
                ",'吡嗪酰胺胶囊\n" +
                ",'地西泮片\n" +
                ",'地西泮注射液\n" +
                ",'地佐辛注射液\n" +
                ",'丁丙诺啡透皮贴剂\n" +
                ",'芬太尼透皮贴剂\n" +
                ",'奋乃静注射液\n" +
                ",'氟哌啶醇注射液\n" +
                ",'氟哌啶注射液\n" +
                ",'氟哌利多注射液\n" +
                ",'复方可待因口服溶液\n" +
                ",'复方磷酸可待因口服溶液\n" +
                ",'复方磷酸可待因口服溶液(Ⅲ)\n" +
                ",'复方磷酸可待因片\n" +
                ",'复方磷酸可待因溶液\n" +
                ",'复方磷酸可待因溶液(Ⅱ)\n" +
                ",'复方磷酸可待因糖浆\n" +
                ",'枸橼酸芬太尼注射液\n" +
                ",'枸橼酸咖啡因注射液\n" +
                ",'枸橼酸舒芬太尼注射液\n" +
                ",'癸氟奋乃静注射液\n" +
                ",'癸酸氟哌啶醇注射液\n" +
                ",'酒石酸布托啡诺鼻喷剂\n" +
                ",'酒石酸布托啡诺注射液\n" +
                ",'可待因桔梗片\n" +
                ",'劳拉西泮片\n" +
                ",'利福定胶囊\n" +
                ",'利福定片\n" +
                ",'利福霉素钠氯化钠注射液\n" +
                ",'利福霉素钠注射液\n" +
                ",'利福平胶囊(Ⅱ)\n" +
                ",'利福平注射液\n" +
                ",'利培酮分散片\n" +
                ",'利培酮胶囊\n" +
                ",'利培酮口崩片\n" +
                ",'利培酮口服溶液\n" +
                ",'利培酮口服液\n" +
                ",'利培酮口腔崩解片\n" +
                ",'利培酮片\n" +
                ",'磷酸可待因缓释片\n" +
                ",'磷酸可待因片\n" +
                ",'磷酸可待因糖浆\n" +
                ",'磷酸可待因注射液\n" +
                ",'硫酸吗啡缓释片\n" +
                ",'硫酸吗啡口服溶液\n" +
                ",'硫酸吗啡片\n" +
                ",'硫酸吗啡栓\n" +
                ",'硫酸吗啡注射液\n" +
                ",'氯丙嗪异丙嗪注射液\n" +
                ",'氯氮?片\n" +
                ",'氯硝西泮片\n" +
                ",'氯硝西泮注射液\n" +
                ",'马来酸麦角新碱注射液\n" +
                ",'马来酸咪达唑仑片\n" +
                ",'吗啡阿托品注射液\n" +
                ",'麦角胺咖啡因片\n" +
                ",'咪达唑仑注射液\n" +
                ",'萘普待因片\n" +
                ",'喷他佐辛注射液\n" +
                ",'羟丁酸钠注射液\n" +
                ",'氢溴酸烯丙吗啡注射液\n" +
                ",'三唑仑片\n" +
                ",'舒必利注射液\n" +
                ",'硝西泮片\n" +
                ",'盐酸阿扑吗啡舌下片\n" +
                ",'盐酸阿扑吗啡注射液\n" +
                ",'盐酸布桂嗪片\n" +
                ",'盐酸布桂嗪注射液\n" +
                ",'盐酸丁丙诺啡舌下片\n" +
                ",'盐酸丁丙诺啡注射液\n" +
                ",'盐酸多塞平注射液\n" +
                ",'盐酸二氢埃托啡舌下片\n" +
                ",'盐酸氟奋乃静注射液\n" +
                ",'盐酸氯胺酮注射液\n" +
                ",'盐酸氯丙嗪注射液\n" +
                ",'盐酸氯米帕明注射液\n" +
                ",'盐酸吗啡缓释片\n" +
                ",'盐酸吗啡片\n" +
                ",'盐酸吗啡注射液\n" +
                ",'盐酸美沙酮口服溶液\n" +
                ",'盐酸美沙酮片\n" +
                ",'盐酸哌替啶片\n" +
                ",'盐酸哌替啶注射液\n" +
                ",'盐酸羟考酮缓释片\n" +
                ",'盐酸羟考酮片\n" +
                ",'盐酸羟考酮注射液\n" +
                ",'盐酸氢吗啡酮注射液\n" +
                ",'盐酸曲马多分散片\n" +
                ",'盐酸曲马多缓释胶囊\n" +
                ",'盐酸曲马多缓释片\n" +
                ",'盐酸曲马多缓释片(Ⅱ)\n" +
                ",'盐酸曲马多胶囊\n" +
                ",'盐酸曲马多氯化钠注射液\n" +
                ",'盐酸曲马多泡腾颗粒\n" +
                ",'盐酸曲马多片\n" +
                ",'盐酸曲马多葡萄糖注射液\n" +
                ",'盐酸曲马多栓\n" +
                ",'盐酸曲马多注射液\n" +
                ",'盐酸替利定口服溶液\n" +
                ",'盐酸乙氨丁醇片\n" +
                ",'盐酸乙胺丁醇胶囊\n" +
                ",'乙胺吡嗪利福异烟片\n" +
                ",'乙胺吡嗪利福异烟片(Ⅱ)\n" +
                ",'乙胺利福异烟片\n" +
                ",'异福胶囊\n" +
                ",'异福片\n" +
                ",'异福酰胺胶囊\n" +
                ",'异福酰胺片\n" +
                ",'异烟肼氯化钠注射液\n" +
                ",'异烟肼注射液\n" +
                ",'右佐匹克隆片\n" +
                ",'愈酚待因口服溶液\n" +
                ",'愈酚伪麻待因口服溶液\n" +
                ",'扎来普隆分散片\n" +
                ",'扎来普隆胶囊\n" +
                ",'扎来普隆口腔崩解片\n" +
                ",'扎来普隆片\n" +
                ",'注射用苯巴比妥钠\n" +
                ",'注射用利福霉素钠\n" +
                ",'注射用利福平\n" +
                ",'注射用利培酮微球\n" +
                ",'注射用盐酸曲马多\n" +
                ",'注射用盐酸瑞芬太尼\n" +
                ",'注射用异戊巴比妥钠\n" +
                ",'佐匹克隆胶囊\n" +
                ",'佐匹克隆片";

        String b = a.replaceAll("\\n", "'");
        System.out.println(b);
    }
}
