package com.legenda.lee.studytest.aboutString;

/**
 * @author: Legenda-Lee(lee.legenda@gmail.com)
 * @date: 2021-08-05 10:53 上午
 * @description:
 */
public class TestAdd {

    public static void main(String[] args) {
        String a ="30/70混合重组人胰岛素注射液\n" +
                "50/50混合重组人胰岛素注射液\n" +
                "L-谷氨酰胺呱仑酸钠颗粒\n" +
                "阿咖酚散\n" +
                "阿卡波糖胶囊\n" +
                "阿卡波糖片\n" +
                "阿仑膦酸钠片\n" +
                "艾拉莫德片\n" +
                "艾普拉唑肠溶片\n" +
                "艾瑞昔布片\n" +
                "艾司奥美拉唑肠溶胶囊\n" +
                "艾司奥美拉唑镁肠溶片\n" +
                "安乃近片\n" +
                "氨酚待因片(Ⅰ)\n" +
                "氨酚咖匹林片\n" +
                "氨酚曲马多片\n" +
                "氨酚双氢可待因片\n" +
                "氨咖甘片\n" +
                "氨糖美辛肠溶片\n" +
                "奥美拉唑肠溶胶囊\n" +
                "奥美拉唑肠溶片\n" +
                "奥美拉唑镁肠溶片\n" +
                "奥美拉唑钠肠溶片\n" +
                "奥替溴铵片\n" +
                "巴氯芬片\n" +
                "保泰松片\n" +
                "贝诺酯片\n" +
                "苯溴马隆片\n" +
                "吡格列酮二甲双胍片\n" +
                "吡罗昔康片\n" +
                "蓖麻油\n" +
                "别嘌醇缓释胶囊\n" +
                "别嘌醇片\n" +
                "丙硫氧嘧啶片\n" +
                "菠萝蛋白酶肠溶片\n" +
                "布拉氏酵母菌散\n" +
                "布洛芬缓释胶囊\n" +
                "布洛芬混悬滴剂\n" +
                "布洛芬混悬液\n" +
                "布洛芬颗粒\n" +
                "布洛芬片\n" +
                "草木犀流浸液片\n" +
                "醋氯芬酸片\n" +
                "醋酸地塞米松片\n" +
                "醋酸泼尼松龙片\n" +
                "醋酸泼尼松片\n" +
                "达格列净片\n" +
                "德谷胰岛素注射液\n" +
                "地奥司明片\n" +
                "地塞米松磷酸钠注射液\n" +
                "地塞米松片\n" +
                "地特胰岛素注射液\n" +
                "颠茄磺苄啶片\n" +
                "对乙酰氨基酚片\n" +
                "多潘立酮片\n" +
                "恩格列净片\n" +
                "二甲双胍格列本脲胶囊\n" +
                "二甲双胍格列本脲胶囊(Ⅰ)\n" +
                "二甲双胍格列本脲胶囊(I)\n" +
                "二甲双胍格列本脲片\n" +
                "二甲双胍格列本脲片(Ⅰ)\n" +
                "二甲双胍格列本脲片(I)\n" +
                "二甲双胍格列本脲片(II)\n" +
                "二甲双胍格列吡嗪片\n" +
                "非布司他片\n" +
                "伏格列波糖分散片\n" +
                "伏格列波糖胶囊\n" +
                "伏格列波糖片\n" +
                "氟比洛芬巴布膏\n" +
                "氟比洛芬凝胶贴膏\n" +
                "复方阿嗪米特肠溶片\n" +
                "复方地芬诺酯片\n" +
                "复方甘草酸苷胶囊\n" +
                "复方甘草酸苷片\n" +
                "复方谷氨酰胺肠溶胶囊\n" +
                "复方谷氨酰胺颗粒\n" +
                "复方金刚烷胺氨基比林片\n" +
                "复方铝酸铋颗粒\n" +
                "复方氯唑沙宗片\n" +
                "复方曲马多片\n" +
                "复方胃蛋白酶散\n" +
                "甘草酸二铵肠溶胶囊\n" +
                "甘草酸二铵胶囊\n" +
                "甘精胰岛素注射液\n" +
                "格列本脲片\n" +
                "格列吡嗪缓释片\n" +
                "格列吡嗪控释片\n" +
                "格列吡嗪片\n" +
                "格列喹酮片\n" +
                "格列美脲分散片\n" +
                "格列美脲胶囊\n" +
                "格列美脲口腔崩解片\n" +
                "格列美脲片\n" +
                "格列齐特缓释片\n" +
                "格列齐特片\n" +
                "格列齐特片(Ⅱ)\n" +
                "格列齐特片(II)\n" +
                "枸橼酸莫沙必利分散片\n" +
                "枸橼酸莫沙必利胶囊\n" +
                "枸橼酸莫沙必利片\n" +
                "谷氨酰胺薁磺酸钠颗粒\n" +
                "甲芬那酸胶囊\n" +
                "甲磺酸溴隐亭片\n" +
                "精蛋白生物合成人胰岛素注射液\n" +
                "精蛋白生物合成人胰岛素注射液(预混30R)\n" +
                "精蛋白生物合成人胰岛素注射液(预混50R)\n" +
                "精蛋白锌胰岛素注射液(30R)\n" +
                "精蛋白锌重组赖脯胰岛素混合注射液(25R)\n" +
                "精蛋白锌重组赖脯胰岛素混合注射液(50R)\n" +
                "精蛋白锌重组人胰岛素混合注射液\n" +
                "精蛋白锌重组人胰岛素注射液\n" +
                "精蛋白重组人胰岛素混合注射液(30/70)\n" +
                "精蛋白重组人胰岛素混合注射液(50/50)\n" +
                "精蛋白重组人胰岛素混合注射液30R\n" +
                "精蛋白重组人胰岛素注射液\n" +
                "赖脯胰岛素注射液\n" +
                "门冬胰岛素30注射液\n" +
                "门冬胰岛素50注射液\n" +
                "门冬胰岛素注射液\n" +
                "胰岛素注射液\n" +
                "重组甘精胰岛素注射液\n" +
                "重组人胰岛素注射液";

        String b = a.replaceAll("\\n", "');\n");
        System.out.println(b);
    }
}
