package com.legenda.lee.studytest.aboutString;

import cn.hutool.core.util.StrUtil;

/**
 * @author: Legenda-Lee(lee.legenda@gmail.com)
 * @date: 2020-12-24 10:22 上午
 * @description:
 */
public class TestFormat {
    public static void main(String[] args) {
        char[] chars = new char[]{'，', '。', '/', '、', ' ', ';', '；'};

        String illness0 = "活血祛瘀，养阴益气，定悸除烦。用于心悸，怔仲，心烦失眠。";
        String illness1 = "消化道肿瘤，胃癌、直肠癌、胰腺癌、肝癌，乳腺癌";
        String illness2 = "滋阴补肾，益气生津。适用于Ⅱ型糖尿病气阴两虚，肾气不足证，可改善口渴喜饮，多食易饥，倦怠乏力，腰膝酸软，烦热失眠等症状。 ";
        String illness3 = "燥湿清热。用于湿热下注，白带，阴囊湿痒。";
        String illness4 = "纳蒙嘎宫昂。 3.阶：蒙给宁宫。 4.中医：清热解毒，利咽止痛。用于急喉痹（急性咽炎）、急乳蛾(急性扁桃体炎)所致的咽喉肿痛。";
        String illness5 = "苗医：迫喔劫漳凯，泱安挡孟。旭嘎洼嘎宏。陡：纳、拉蒙宁宫。阶：蒙给宁宫，干宫检，罗项。中医：疏风散热。消肿止痛，清利咽喉。用于急性咽炎。慢性咽炎急性发作．咽痛．咽粘膜红肿。咽干。口臭等症。";


        String illness6 = "周围神经病变、消化不良";
        illness6 = "惊吓肺结核 坐骨神经痛 免疫力低下 咽喉肿痛";
        illness6 = "温经通窍止痛。适用于神经根型颈椎病瘀血阻络证";
        illness6 = "湿疹、神经性皮炎";
        illness6 = "湿疹、神经性皮炎、";
        illness6 = "2型糖尿病、周围神经病变";
        illness6 = "偏头痛、周围神经炎";
        illness6 = "用于湿疹、接触性皮炎、脂溢性皮炎、神经性皮炎、体癣、股癣以及";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎及皮肤瘙痒症。";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎皮肤瘙痒症。";
        illness6 = "用于虫咬皮炎、湿疹、瘙痒症、神经性皮炎、过敏性皮炎、丘疹性荨麻疹等";
        illness6 = "神经性皮炎、关节炎";
        illness6 = "神经性皮炎、呼吸道感染";
        illness6 = "上呼吸道感染、神经炎";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎皮肤瘙痒症。";
        illness6 = "痔疮 咽炎 神经性头痛 尿路感染 骨质增生";
        illness6 = "白细胞减少症、神经炎";
        illness6 = "高血压；神经痛及风湿痛";
        illness6 = "养血息风。用于肝肾阴虚所致的头晕目眩、头痛耳鸣、口苦咽干、腰膝痠软、脱发、白发；血管神经性头痛、脂溢性脱发见上述证候者。";
        illness6 = "如头痛、偏头痛、牙痛、神经痛、肌肉痛、痛经及关节痛等。";
        illness6 = "如湿疹包括特异性湿疹和盘状湿疹；结节性痒疹；银屑病(泛发斑块型除外)；神经性皮肤病包括单纯性苔藓；扁平苔藓；脂溢性皮炎；接触性过敏；盘形红斑狼疮；泛发性红斑全身类固醇激素治疗的辅助用药";
        illness6 = "温经通窍止痛。适用于神经根型";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎及皮肤瘙痒症";
        illness6 = "皮肤瘙痒、神经性皮炎";
        illness6 = "口腔溃疡肺胃热盛、2型糖尿病、糖尿病周围神经病";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎皮肤瘙痒症";
        illness6 = "神经性皮炎、体癣";
        illness6 = "糖尿病神经性病变、高血压";
        illness6 = "耳鸣、周围神经病";
        illness6 = "也用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。";
        illness6 = "周围神经病变.增生性关节炎";
        illness6 = "周围神经病变、高血脂";
        illness6 = "用于湿疹、接触性皮炎、脂溢性皮炎、神经性皮炎、体癣、";
        illness6 = "用于湿疹、神经性皮炎、异位";
        illness6 = "也用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛。";
        illness6 = "冠心病。末梢神经炎。血脂异常。";
        illness6 = "带状疱疹后神经痛：慢性病需长期用药";
        illness6 = "过敏性皮炎、周围神经病变";
        illness6 = "周围神经炎、脑血管病";
        illness6 = "周围神经病。贫血。";
        illness6 = "本品为肾上腺皮质激素类药。用于过敏性皮炎、异位性皮炎、接触性皮炎、脂溢性皮炎、湿疹、皮肤瘙痒症、银屑病、神经性皮炎等。";
        illness6 = "湿疹、接触性皮炎、脂溢性皮炎、神经性皮炎";
        illness6 = "湿疹、神经性皮炎、心绞痛";
        illness6 = "用于普通感冒或流行性感冒引起的发热。也用于缓解轻中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。";
        illness6 = "神经炎：慢性病长期用药";
        illness6 = "腰肌劳损、周围神经病变";
        illness6 = "冠心病、周围神经病变";
        illness6 = "带状疱疹后神经痛、呼吸道感染";
        illness6 = "清炎镇痛。用于神经痛";
        illness6 = "用于湿疹、神经性皮炎、异位性皮炎皮肤瘙痒症。";
        illness6 = "糖尿病神经病变、糖尿病";
        illness6 = "高血压、周围神经炎";
        illness6 = "也用于缓解轻中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。";
        illness6 = "刺激和抑制神经、消炎抗菌、健胃祛风";
        illness6 = "周围神经病变、尿路感染";
        illness6 = "温经通窍止痛。适用于神经根型颈椎病瘀血阻";
        illness6 = "用于湿疹、接触性皮炎、脂溢性皮炎、神经性皮炎、体癣、股癣以及手足癣等。";


        // 1、首先去除收尾空格
        String illness = illness6.trim();
        // 2、将诊断字符串中的指定字符都替换成英文逗号
        illness = StrUtil.replaceChars(illness, chars, ",");
        // 3、替换后对可能出现的连续的英文逗号缩减为一个
        illness = StrUtil.replace(illness, ",,,,", ",");
        illness = StrUtil.replace(illness, ",,,", ",");
        illness = StrUtil.replace(illness, ",,", ",");

        System.out.println(illness);
    }
}
